VDowbensky/Panchip/WHXY/SPL/Libraries/src/cw32w031_adc.c
    // ADC_SerialChStruct->ADC_SqrEns = ADC_SqrEns03;
    REGBITS_MODIFY(CW_ADC->SQR0,
                   ADC_SQR0_ENS_Msk | ADC_SQR0_SQR0_Msk |
                       ADC_SQR0_SQR1_Msk | ADC_SQR0_SQR2_Msk | ADC_SQR0_SQR3_Msk,
                   ADC_SerialChStruct->ADC_SqrEns |
                       (ADC_SerialChStruct->ADC_Sqr3Chmux << ADC_SQR0_SQR3_Pos) |
                       (ADC_SerialChStruct->ADC_Sqr2Chmux << ADC_SQR0_SQR2_Pos) |
                       (ADC_SerialChStruct->ADC_Sqr1Chmux << ADC_SQR0_SQR1_Pos) |
                       ADC_SerialChStruct->ADC_Sqr0Chmux);

    REGBITS_MODIFY(CW_ADC->CR1, ADC_CR1_DMASOFEN_Msk,
                   ADC_SerialChStruct->ADC_DMASOFEn);

    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr0Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr1Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr2Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr3Chmux);
}

/**
 * @brief
 *          序列SQR0~SQR4转换通道配置
 *
 * @param   ADC_SerialChStruct
 */
void ADC_Sqr04ChannelCfg(ADC_SerialChTypeDef *ADC_SerialChStruct)
{
    ASSERT(NULL != ADC_SerialChStruct)
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr0Chmux));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr1Chmux));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr2Chmux));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr3Chmux));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr4Chmux));
    assert_param(IS_ADC_SQR_ENS(ADC_SerialChStruct->ADC_SqrEns));
    assert_param(IS_ADC_DMASOF_ENABLE(ADC_SerialChStruct->ADC_DMASOFEn));

    // ADC_SerialChStruct->ADC_SqrEns = ADC_SqrEns03;
    REGBITS_MODIFY(CW_ADC->SQR0,
                   ADC_SQR0_ENS_Msk | ADC_SQR0_SQR0_Msk |
                       ADC_SQR0_SQR1_Msk | ADC_SQR0_SQR2_Msk | ADC_SQR0_SQR3_Msk,
                   ADC_SerialChStruct->ADC_SqrEns |
                       (ADC_SerialChStruct->ADC_Sqr3Chmux << ADC_SQR0_SQR3_Pos) |
                       (ADC_SerialChStruct->ADC_Sqr2Chmux << ADC_SQR0_SQR2_Pos) |
                       (ADC_SerialChStruct->ADC_Sqr1Chmux << ADC_SQR0_SQR1_Pos) |
                       ADC_SerialChStruct->ADC_Sqr0Chmux);

    REGBITS_MODIFY(CW_ADC->SQR1,
                   ADC_SQR1_SQR4_Msk, ADC_SerialChStruct->ADC_Sqr4Chmux);

    REGBITS_MODIFY(CW_ADC->CR1, ADC_CR1_DMASOFEN_Msk,
                   ADC_SerialChStruct->ADC_DMASOFEn);

    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr0Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr1Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr2Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr3Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr4Chmux);
}

/**
 * @brief
 *          序列SQR0~SQR5转换通道配置
 *
 * @param   ADC_SerialChStruct
 */
void ADC_Sqr05ChannelCfg(ADC_SerialChTypeDef *ADC_SerialChStruct)
{
    ASSERT(NULL != ADC_SerialChStruct)
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr0Chmux));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr1Chmux));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr2Chmux));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr3Chmux));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr4Chmux));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr5Chmux));
    assert_param(IS_ADC_SQR_ENS(ADC_SerialChStruct->ADC_SqrEns));
    assert_param(IS_ADC_DMASOF_ENABLE(ADC_SerialChStruct->ADC_DMASOFEn));

    // ADC_SerialChStruct->ADC_SqrEns = ADC_SqrEns03;
    REGBITS_MODIFY(CW_ADC->SQR0,
                   ADC_SQR0_ENS_Msk | ADC_SQR0_SQR0_Msk |
                       ADC_SQR0_SQR1_Msk | ADC_SQR0_SQR2_Msk | ADC_SQR0_SQR3_Msk,
                   ADC_SerialChStruct->ADC_SqrEns |
                       (ADC_SerialChStruct->ADC_Sqr3Chmux << ADC_SQR0_SQR3_Pos) |
                       (ADC_SerialChStruct->ADC_Sqr2Chmux << ADC_SQR0_SQR2_Pos) |
                       (ADC_SerialChStruct->ADC_Sqr1Chmux << ADC_SQR0_SQR1_Pos) |
                       ADC_SerialChStruct->ADC_Sqr0Chmux);

    REGBITS_MODIFY(CW_ADC->SQR1,
                   ADC_SQR1_SQR4_Msk | ADC_SQR1_SQR5_Msk,
                   (ADC_SerialChStruct->ADC_Sqr5Chmux << ADC_SQR1_SQR5_Pos) |
                       ADC_SerialChStruct->ADC_Sqr4Chmux);

    REGBITS_MODIFY(CW_ADC->CR1, ADC_CR1_DMASOFEN_Msk,
                   ADC_SerialChStruct->ADC_DMASOFEn);

    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr0Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr1Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr2Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr3Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr4Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr5Chmux);
}

/**
 * @brief
 *          序列SQR0~SQR6转换通道配置
 *
 * @param   ADC_SerialChStruct
 */
void ADC_Sqr06ChannelCfg(ADC_SerialChTypeDef *ADC_SerialChStruct)
{
    ASSERT(NULL != ADC_SerialChStruct)
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr0Chmux));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr1Chmux));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr2Chmux));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr3Chmux));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr4Chmux));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr5Chmux));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr6Chmux));
    assert_param(IS_ADC_SQR_ENS(ADC_SerialChStruct->ADC_SqrEns));
    assert_param(IS_ADC_DMASOF_ENABLE(ADC_SerialChStruct->ADC_DMASOFEn));

    // ADC_SerialChStruct->ADC_SqrEns = ADC_SqrEns03;
    REGBITS_MODIFY(CW_ADC->SQR0,
                   ADC_SQR0_ENS_Msk | ADC_SQR0_SQR0_Msk |
                       ADC_SQR0_SQR1_Msk | ADC_SQR0_SQR2_Msk | ADC_SQR0_SQR3_Msk,
                   ADC_SerialChStruct->ADC_SqrEns |
                       (ADC_SerialChStruct->ADC_Sqr3Chmux << ADC_SQR0_SQR3_Pos) |
                       (ADC_SerialChStruct->ADC_Sqr2Chmux << ADC_SQR0_SQR2_Pos) |
                       (ADC_SerialChStruct->ADC_Sqr1Chmux << ADC_SQR0_SQR1_Pos) |
                       ADC_SerialChStruct->ADC_Sqr0Chmux);

    REGBITS_MODIFY(CW_ADC->SQR1,
                   ADC_SQR1_SQR4_Msk | ADC_SQR1_SQR5_Msk |
                       ADC_SQR1_SQR6_Msk,
                   (ADC_SerialChStruct->ADC_Sqr6Chmux << ADC_SQR1_SQR6_Pos) |
                       (ADC_SerialChStruct->ADC_Sqr5Chmux << ADC_SQR1_SQR5_Pos) |
                       ADC_SerialChStruct->ADC_Sqr4Chmux);

    REGBITS_MODIFY(CW_ADC->CR1, ADC_CR1_DMASOFEN_Msk,
                   ADC_SerialChStruct->ADC_DMASOFEn);

    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr0Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr1Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr2Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr3Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr4Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr5Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr6Chmux);
}

/**
 * @brief
 *          序列SQR0~SQR7转换通道配置
 *
 * @param   ADC_SerialChStruct
 */
void ADC_Sqr07ChannelCfg(ADC_SerialChTypeDef *ADC_SerialChStruct)
{
    ASSERT(NULL != ADC_SerialChStruct)
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr0Chmux));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr1Chmux));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr2Chmux));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr3Chmux));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr4Chmux));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr5Chmux));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr6Chmux));
    assert_param(IS_ADC_SQR_CH(ADC_SerialChStruct->ADC_Sqr7Chmux));
    assert_param(IS_ADC_SQR_ENS(ADC_SerialChStruct->ADC_SqrEns));
    assert_param(IS_ADC_DMASOF_ENABLE(ADC_SerialChStruct->ADC_DMASOFEn));

