VDowbensky/Panchip/WHXY/SPL/Libraries/src/cw32w031_adc.c
    // ADC_SerialChStruct->ADC_SqrEns = ADC_SqrEns03;
    REGBITS_MODIFY(CW_ADC->SQR0,
                   ADC_SQR0_ENS_Msk | ADC_SQR0_SQR0_Msk |
                       ADC_SQR0_SQR1_Msk | ADC_SQR0_SQR2_Msk | ADC_SQR0_SQR3_Msk,
                   ADC_SerialChStruct->ADC_SqrEns |
                       (ADC_SerialChStruct->ADC_Sqr3Chmux << ADC_SQR0_SQR3_Pos) |
                       (ADC_SerialChStruct->ADC_Sqr2Chmux << ADC_SQR0_SQR2_Pos) |
                       (ADC_SerialChStruct->ADC_Sqr1Chmux << ADC_SQR0_SQR1_Pos) |
                       ADC_SerialChStruct->ADC_Sqr0Chmux);

    REGBITS_MODIFY(CW_ADC->SQR1,
                   ADC_SQR1_SQR4_Msk | ADC_SQR1_SQR5_Msk |
                       ADC_SQR1_SQR6_Msk | ADC_SQR1_SQR7_Msk,
                   (ADC_SerialChStruct->ADC_Sqr7Chmux << ADC_SQR1_SQR7_Pos) |
                       (ADC_SerialChStruct->ADC_Sqr6Chmux << ADC_SQR1_SQR6_Pos) |
                       (ADC_SerialChStruct->ADC_Sqr5Chmux << ADC_SQR1_SQR5_Pos) |
                       ADC_SerialChStruct->ADC_Sqr4Chmux);

    REGBITS_MODIFY(CW_ADC->CR1, ADC_CR1_DMASOFEN_Msk,
                   ADC_SerialChStruct->ADC_DMASOFEn);

    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr0Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr1Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr2Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr3Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr4Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr5Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr6Chmux);
    ADC_SetSerialCh(ADC_SerialChStruct->ADC_Sqr7Chmux);
}
/**
 * @brief
 *          触发DMASOC读取命令
 *
 * @param   NewState:
 *          @arg DISABLE
 *          @arg ENABLE
 */
void ADC_DmaSocCmd(FunctionalState NewState)
{
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    if (NewState != DISABLE)
    {
        REGBITS_SET(CW_ADC->CR1, ADC_CR1_DMASOCEN_Msk);
    }
    else
    {
        REGBITS_CLR(CW_ADC->CR1, ADC_CR1_DMASOCEN_Msk);
    }
}

/**
 * @brief
 *       触发DMASOC读取使能
 *
 */
void ADC_DmaSocEnable(void)
{
    REGBITS_SET(CW_ADC->CR1, ADC_CR1_DMASOCEN_Msk);
}

/**
 * @brief
 *       触发DMASOC读取禁止
 *
 */
void ADC_DmaSocDisable(void)
{
    REGBITS_CLR(CW_ADC->CR1, ADC_CR1_DMASOCEN_Msk);
}

/**
 * @brief
 *          触发DMASOF读取命令
 *
 * @param   NewState:
 *          @arg DISABLE
 *          @arg ENABLE
 */
void ADC_DmaSofCmd(FunctionalState NewState)
{
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    if (NewState != DISABLE)
    {
        REGBITS_SET(CW_ADC->CR1, ADC_CR1_DMASOFEN_Msk);
    }
    else
    {
        REGBITS_CLR(CW_ADC->CR1, ADC_CR1_DMASOFEN_Msk);
    }
}

/**
 * @brief
 *       触发DMASOF读取使能
 *
 */
void ADC_DmaSofEnable(void)
{
    REGBITS_SET(CW_ADC->CR1, ADC_CR1_DMASOFEN_Msk);
}

/**
 * @brief
 *       触发DMASOF读取禁止
 *
 */
void ADC_DmaSofDisable(void)
{
    REGBITS_CLR(CW_ADC->CR1, ADC_CR1_DMASOFEN_Msk);
}

/**
 * @brief
 *          获取单次转换采样值
 *
 * @param
 *
 * @return uint16_t
 */
uint16_t ADC_GetConversionValue(void)
{
    return (uint16_t)(CW_ADC->RESULT0);
}

/**
 * @brief
 *          获取SQR0通道采样值
 *
 * @param   pAdcResult
 */
void ADC_GetSqr0Result(uint16_t *pAdcResult)
{
    if (NULL == pAdcResult)
    {
        return;
    }
    *pAdcResult = (uint16_t)(CW_ADC->RESULT0);
}

/**
 * @brief
 *          获取SQR1通道采样值
 *
 * @param   pAdcResult
 */
void ADC_GetSqr1Result(uint16_t *pAdcResult)
{
    if (NULL == pAdcResult)
    {
        return;
    }
    *pAdcResult = (uint16_t)(CW_ADC->RESULT1);
}

/**
 * @brief
 *          获取SQR2通道采样值
 *
 * @param   pAdcResult
 */
void ADC_GetSqr2Result(uint16_t *pAdcResult)
{
    if (NULL == pAdcResult)
    {
        return;
    }
    *pAdcResult = (uint16_t)(CW_ADC->RESULT2);
}

/**
 * @brief
 *          获取SQR3通道采样值
 *
 * @param   pAdcResult
 */
void ADC_GetSqr3Result(uint16_t *pAdcResult)
{
    if (NULL == pAdcResult)
    {
        return;
    }
    *pAdcResult = (uint16_t)(CW_ADC->RESULT3);
}

/**
 * @brief
 *          获取SQR4通道采样值
 *
 * @param   pAdcResult
 */
void ADC_GetSqr4Result(uint16_t *pAdcResult)
{
    if (NULL == pAdcResult)
    {
        return;
    }
    *pAdcResult = (uint16_t)(CW_ADC->RESULT4);
}

/**
 * @brief
 *          获取SQR5通道采样值
 *
 * @param   pAdcResult
 */
void ADC_GetSqr5Result(uint16_t *pAdcResult)
{
    if (NULL == pAdcResult)
    {
        return;
    }
    *pAdcResult = (uint16_t)(CW_ADC->RESULT5);
}

/**
 * @brief
 *          获取SQR6通道采样值
 *
 * @param   pAdcResult
 */
void ADC_GetSqr6Result(uint16_t *pAdcResult)
{
    if (NULL == pAdcResult)
    {
        return;
    }
    *pAdcResult = (uint16_t)(CW_ADC->RESULT6);
}

/**
 * @brief
 *          获取SQR7通道采样值
 *
 * @param   pAdcResult
 */
void ADC_GetSqr7Result(uint16_t *pAdcResult)
{
    if (NULL == pAdcResult)
    {
        return;
    }
    *pAdcResult = (uint16_t)(CW_ADC->RESULT7);
}

/**
 * @brief
 *          获取累加采样值
 *
 * @param   pAdcAccResult
 */
void ADC_GetAccResult(uint32_t *pAdcAccResult)
{
    if (NULL == pAdcAccResult)
    {
        return;
    }

    *pAdcAccResult = (uint32_t)(CW_ADC->RESULTACC);
}

/**
 * @brief
 *          清零累加采样值
 */
void ADC_ClrAccResult(void)
{
    REGBITS_SET(CW_ADC->CR2, ADC_CR2_ACCRST_Msk);
}

/**
 * @brief
 *          设置ADC参考电压
 *
 * @param   ADC_VrefSel:
 *          @arg ADC_Vref_BGR1p5
 *          @arg ADC_Vref_BGR2p5
 *          @arg ADC_Vref_Extern1
 *          @arg ADC_Vref_VDDA
 */
void ADC_SetVref(uint32_t ADC_VrefSel)
{
    assert_param(IS_ADC_VREF_SEL(ADC_VrefSel));

    REGBITS_MODIFY(CW_ADC->CR0, ADC_CR0_REF_Msk,
                   ADC_VrefSel);
    if (ADC_VrefSel == ADC_Vref_Extern1)
    {
        //初始化ExRef：PB00
        REGBITS_SET(CW_SYSCTRL->AHBEN, SYSCTRL_AHBEN_GPIOB_Msk); //打开GPIO时钟
        PB00_ANALOG_ENABLE();
    }
}
/**
 * @brief
 *          设置ADC结果对齐方式
 *
 * @param   enAlign:
 *          @arg ADC_AlignRight
 *          @arg ADC_AlignLeft
 */
void ADC_SetAlign(uint32_t enAlign)
{
    REGBITS_MODIFY(CW_ADC->CR1, ADC_CR1_ALIGN_Msk, enAlign);
}

/**
 * @brief
 *        设置单通道ADC转换结果溢出保存策略
 *
 * @param enDiscard:
 *        @arg ADC_DiscardNull
 *        @arg ADC_DiscardEnable
 */
void ADC_SetDiscard(uint32_t enDiscard)
{
    assert_param(IS_ADC_DATA_DISCARD(enDiscard));
    REGBITS_MODIFY(CW_ADC->CR1, ADC_CR1_DISCARD_Msk, enDiscard);
}

/**
 * @brief
 *        设置内置温度传感器使能控制
 *
 * @param enTs:
 *        @arg ADC_TsDisable
 *        @arg ADC_TsEnable
 */
void ADC_SetTs(uint32_t enTs)
{
    assert_param(IS_ADC_TS_ENABLE(enTs));
    REGBITS_MODIFY(CW_ADC->CR0, ADC_CR0_TSEN_Msk, enTs);
}

/**
 * @brief
 *        读取ADC参考电压1.5V时的温度传感器的测量温度
 *
 * @param fAdcTsDegree
 */
void ADC_GetTsVref1V5(float *fAdcTsDegree)
{
    uint16_t u16AdcResult;
    uint8_t temp1;
    uint16_t temp2;
    temp1 = *((uint8_t *)(ADDR_T0));
    temp2 = *((uint16_t *)(ADDR_TRIM_1P5));
    /*Caution: Must select ADC_GetSqr0Result()~ADC_GetSqr7Result() instead of ADC_GetConversionValue() if using ADC_SQR convertion.
     * ADC single channel convertion is default.
     */
    u16AdcResult = ADC_GetConversionValue();
    // ADC_GetSqr0Result(&u16AdcResult); //Using ADC_SQR0.
    // ADC_GetSqr1Result(&u16AdcResult); //Using ADC_SQR1.
    // ADC_GetSqr2Result(&u16AdcResult); //Using ADC_SQR2.
    // ADC_GetSqr3Result(&u16AdcResult); //Using ADC_SQR3.
    // ADC_GetSqr4Result(&u16AdcResult); //Using ADC_SQR4.
    // ADC_GetSqr5Result(&u16AdcResult); //Using ADC_SQR5.
    // ADC_GetSqr6Result(&u16AdcResult); //Using ADC_SQR6.
    // ADC_GetSqr7Result(&u16AdcResult); //Using ADC_SQR7.
    *fAdcTsDegree = temp1 * 0.5f + COEFF_TS * 1.5f * (u16AdcResult - temp2);
}

/**
 * @brief
 *        读取ADC参考电压2.5V时的温度传感器的测量温度
 *
 * @param fAdcTsDegree
 */
void ADC_GetTsVref2V5(float *fAdcTsDegree)
{
    uint16_t u16AdcResult;
    uint8_t temp1;
    uint16_t temp2;
    temp1 = *((uint8_t *)(ADDR_T0));
    temp2 = *((uint16_t *)(ADDR_TRIM_2P5));
    /*Caution: Must select ADC_GetSqr0Result()~ADC_GetSqr7Result() instead of ADC_GetConversionValue() if using ADC_SQR convertion.
     * ADC single channel convertion is default.
     */
    u16AdcResult = ADC_GetConversionValue();
    // ADC_GetSqr0Result(&u16AdcResult); //Using ADC_SQR0.
    // ADC_GetSqr1Result(&u16AdcResult); //Using ADC_SQR1.
    // ADC_GetSqr2Result(&u16AdcResult); //Using ADC_SQR2.
    // ADC_GetSqr3Result(&u16AdcResult); //Using ADC_SQR3.
    // ADC_GetSqr4Result(&u16AdcResult); //Using ADC_SQR4.
    // ADC_GetSqr5Result(&u16AdcResult); //Using ADC_SQR5.
    // ADC_GetSqr6Result(&u16AdcResult); //Using ADC_SQR6.
    // ADC_GetSqr7Result(&u16AdcResult); //Using ADC_SQR7.
    *fAdcTsDegree = temp1 * 0.5f + COEFF_TS * 2.5f * (u16AdcResult - temp2);
}

/**
 * @brief
 *          ADC自动停止配置
 *
 * @param   enAutoStop:
 *          @arg ADC_AutoStopDisable
 *          @arg ADC_AutoStopEnable
 */
void ADC_AutoStop(uint32_t enAutoStop)
{
    REGBITS_MODIFY(CW_ADC->START, ADC_START_AUTOSTOP_Msk, enAutoStop);
}

/**
 * @brief
 *          ADC中断配置
 *
 * @param   ADC_IT:
 *          @arg ADC_IT_READY
 *          @arg ADC_IT_OVW
 *          @arg ADC_IT_WDTR
 *          @arg ADC_IT_WDTH
 *          @arg ADC_IT_WDTL
 *          @arg ADC_IT_EOA
 *          @arg ADC_IT_EOS
 *          @arg ADC_IT_EOC
 * @param   NewState:
 *          @arg DISABLE
 *          @arg ENABLE
 */
void ADC_ITConfig(uint16_t ADC_IT, FunctionalState NewState)
{
    uint8_t itMask = 0;
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    assert_param(IS_ADC_IT(ADC_IT));
    /* Get the ADC IT index */
    itMask = (uint8_t)ADC_IT;
    if (NewState != DISABLE)
    {
        /* Enable the selected ADC interrupts */
        CW_ADC->IER |= itMask;
    }
    else
    {
        /* Disable the selected ADC interrupts */
        CW_ADC->IER &= (~(uint32_t)itMask);
    }
}

/**
 * @brief
 *          使能NVIC中ADC中断
 *
 * @param   intPriority:
 *          @arg 0 ~ 3
 */
void ADC_EnableNvic(uint8_t intPriority)
{
    if (intPriority < (1UL << __NVIC_PRIO_BITS))
    {
        NVIC_ClearPendingIRQ(ADC_IRQn);
        NVIC_EnableIRQ(ADC_IRQn);
        NVIC_SetPriority(ADC_IRQn, intPriority);
    }
}

/**
 * @brief
 *          禁用NVIC中ADC中断
 *
 * @param
 *
 */
void ADC_DisableNvic(void)
{
    NVIC_ClearPendingIRQ(ADC_IRQn);
    NVIC_DisableIRQ(ADC_IRQn);
    NVIC_SetPriority(ADC_IRQn, ADC_INT_PRIORITY);
}
//@} // AdcGroup

/******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
